In [1]:
import pandas as pd
import numpy as np

ser = pd.Series(dtype="object")

print(ser)

data = np.array(['a', 'e', 'i', 'o', 'u'])

ser = pd.Series(data)
print(ser)

Series([], dtype: object)
0    a
1    e
2    i
3    o
4    u
dtype: object

In [2]:
import pandas as pd

df = pd.DataFrame()
print(df)

lst = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']

df = pd.DataFrame(lst, columns=['Words'])

print(df)

Empty DataFrame
Columns: []
Index: []
    Words
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [7]:
import pandas as pd

# reading csv file 
df = pd.read_csv("people.csv")
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

In [9]:
# List all tables in the SQLite database
from sqlalchemy import inspect

inspector = inspect(cnx)
print("Tables in the database:", inspector.get_table_names())

Tables in the database: []

In [13]:
# import the modules
import pandas as pd 
from sqlalchemy import create_engine

# SQLAlchemy connectable
cnx = create_engine('sqlite:///employee.db').connect()

# Write the DataFrame 'data' to the 'employee' table if it doesn't exist
data.to_sql('employee', cnx, if_exists='replace', index=False)

# table named 'employee' will be returned as a dataframe.
df = pd.read_sql_table('employee', cnx)
print(df)

  First Name Last Name     Sex                       Email Date of birth  \
0     Shelby   Terrell    Male        elijah57@example.net    1945-10-26
1    Phillip   Summers  Female       bethany14@example.com    1910-03-24
2   Kristine    Travis    Male       bthompson@example.com    1992-07-02
3    Yesenia  Martinez    Male   kaitlinkaiser@example.com    2017-08-03
4       Lori      Todd    Male  buchananmanuel@example.net    1938-12-01

            Job Title
0     Games developer
1      Phytotherapist
2           Homeopath
3   Market researcher
4  Veterinary surgeon

In [15]:
# Write the DataFrame 'data' to the 'students' table if it doesn't exist
data.to_sql('students', cnx, if_exists='replace', index=False)

# Read the 'students' table from the database into a DataFrame
df = pd.read_sql_table('students', cnx)
print(df)

  First Name Last Name     Sex                       Email Date of birth  \
0     Shelby   Terrell    Male        elijah57@example.net    1945-10-26
1    Phillip   Summers  Female       bethany14@example.com    1910-03-24
2   Kristine    Travis    Male       bthompson@example.com    1992-07-02
3    Yesenia  Martinez    Male   kaitlinkaiser@example.com    2017-08-03
4       Lori      Todd    Male  buchananmanuel@example.net    1938-12-01

            Job Title
0     Games developer
1      Phytotherapist
2           Homeopath
3   Market researcher
4  Veterinary surgeon

In [16]:
# import the modules
import pandas as pd 
from sqlalchemy import create_engine

# SQLAlchemy connectable
cnx = create_engine('sqlite:///employee.db').connect()

# table named 'employee' will be returned as a dataframe.
df = pd.read_sql_table('employee', cnx)
print(df)

  First Name Last Name     Sex                       Email Date of birth  \
0     Shelby   Terrell    Male        elijah57@example.net    1945-10-26
1    Phillip   Summers  Female       bethany14@example.com    1910-03-24
2   Kristine    Travis    Male       bthompson@example.com    1992-07-02
3    Yesenia  Martinez    Male   kaitlinkaiser@example.com    2017-08-03
4       Lori      Todd    Male  buchananmanuel@example.net    1938-12-01

            Job Title
0     Games developer
1      Phytotherapist
2           Homeopath
3   Market researcher
4  Veterinary surgeon

In [20]:
# import the necessary packages
import pandas
from sqlalchemy import create_engine

# Create the engine to connect to the inbuilt 
# sqllite database
engine = create_engine("sqlite+pysqlite:///:memory:")

# Use the existing DataFrame 'data' defined earlier in the notebook

# print the sample of a dataframe
data.head()

# Write data into the table in sqllite database
data.to_sql('loan_data', engine)

5